package 面向对象;
/*
一.JAVA面向对象学习的三条主线：
    1.JAVA类及类的成员：属性、方法、构造器、代码块、内部内
    2.面向对象的三大特征：封装、继承、多态
    3.其他关键字：this,super,static,final,abstract,interface,package,import
    "大处着眼，小处着手"


二.经典例子“人把大象装进冰箱”
1.面向过程：强调的是功能行为，以函数为最小单位，考虑怎么做。
1）把冰箱门打开
2）抬起大象，塞进冰箱
3）关闭冰箱

2.面向对象：强调具备了功能的对象，以类、对象为最小单位，考虑谁来做
人{
    打开(冰箱){
        冰箱.开开();
    }
    抬起(大象){
        大象.进入(冰箱);
        }
    关闭(冰箱){
        冰箱.闭合();
    }

}

冰箱{
    开开(){}
}

大象{
    进入(冰箱){
    }

}

三.面向对象的2个要素
类：对一类失误的秒速，是抽象的、概念上的定义
对象：是实际存在的该类失误的每个个体，因而也称为实例(instance)
>面向对象程序设计的重点是类的设计
>设计类，就是设计类的成员

 */

public class OOPTest {
}
